{"_id":{"$oid":"6973c4dcffbe3c66075a2afb"},"titulo":"Plataforma Gamificada para o Ensino da Matemática no Ensino Básico: Design, Desenvolvimento e Avaliação","orientadorId":{"$oid":"6973b7cbffbe3c66075a2a91"},"coorientadorIds":[{"$oid":"6973b720ffbe3c66075a2a88"}],"palavrasChave":["Gamificação","Educação matemática","Engagement estudantil","Motivação académica","Plataformas educativas"],"alunoIds":[{"$oid":"6973c85720223fce745c4715"},{"$oid":"6973c85720223fce745c4716"}],"descricaoObjetivos":"Este trabalho propõe o desenvolvimento de uma plataforma gamificada para o ensino da matemática no ensino básico, integrando mecânicas de jogo.\nAdota-se uma abordagem Design Science Research com metodologia mista, dividida em cinco fases: \n(1) revisão de literatura e levantamento de requisitos;\n(2) design e prototipagem da plataforma;\n(3) desenvolvimento técnico; (4) avaliação empírica com estudo quasi-experimental envolvendo 60-120 alunos, recolhendo dados quantitativos (métricas de uso, testes, questionários) e qualitativos (entrevistas, focus groups);\n(5) análise de resultados e redação da dissertação.","createdAt":{"$date":"2026-01-23T18:58:36.637Z"},"updatedAt":{"$date":"2026-01-23T21:42:23.948Z"},"__v":2}
{"_id":{"$oid":"6974f264f304208c863fed36"},"titulo":"Cibersegurança educacional, Deteção de intrusões, Machine Learning, Proteção de dados escolares, Segurança de redes","orientadorId":{"$oid":"6973b7cbffbe3c66075a2a91"},"coorientadorIds":[{"$oid":"6973b7bdffbe3c66075a2a8d"}],"palavrasChave":["Cibersegurança educacional","Deteção de intrusões","Machine Learning","Proteção de dados escolares","Segurança de redes"],"alunoIds":[{"$oid":"6973c85720223fce745c4717"}],"descricaoObjetivos":"Este trabalho propõe o desenvolvimento de um sistema de monitorização e deteção de ciberameaças específico para ambientes escolares, utilizando técnicas de machine learning para identificar padrões anómalos de tráfego e comportamentos suspeitos. O objetivo principal é avaliar a eficácia do sistema na proteção de dados sensíveis (informação de alunos, registos académicos) e na prevenção de ataques comuns em instituições de ensino (phishing, ransomware, acessos não autorizados).\nAdota-se uma abordagem Design Science Research com metodologia quantitativa, dividida em cinco fases: \n(1) análise de vulnerabilidades e ameaças em redes escolares através de auditorias; \n(2) design da arquitetura do sistema de monitorização; \n(3) desenvolvimento e implementação de algoritmos de ML para deteção de anomalias; \n(4) validação em ambiente escolar real durante 2-3 meses, recolhendo métricas de eficácia (taxa de deteção, falsos positivos); \n(5) análise de resultados e formulação de guidelines de cibersegurança para escolas.","createdAt":{"$date":"2026-01-24T16:25:08.816Z"},"updatedAt":{"$date":"2026-01-24T16:25:08.816Z"},"__v":0}
{"_id":{"$oid":"6974f2a1f304208c863fed43"},"titulo":"Sistema de Learning Analytics para Previsão de Insucesso Escolar: Aplicação de Algoritmos Preditivos no Ensino Básico e Secundário","orientadorId":{"$oid":"6973b7cbffbe3c66075a2a91"},"coorientadorIds":[{"$oid":"6973b720ffbe3c66075a2a88"}],"palavrasChave":["Learning Analytics","Previsão de insucesso escolar","Data mining educacional","Análise preditiva","Intervenção precoce"],"alunoIds":[{"$oid":"6973c85720223fce745c4714"}],"descricaoObjetivos":"Este trabalho propõe o desenvolvimento de um sistema de learning analytics que utiliza dados históricos e em tempo real (presenças, notas, participação, dados socioeconómicos) para prever com antecedência alunos em risco de insucesso escolar. O objetivo principal é criar modelos preditivos precisos que permitam aos professores e direções escolares intervir atempadamente, disponibilizando dashboards intuitivos com alertas e recomendações de intervenção personalizadas.\nAdota-se uma abordagem quantitativa baseada em Data Science, dividida em cinco fases: \n(1) revisão de literatura e recolha de dados históricos anonimizados de escolas parceiras; (\n2) análise exploratória e engenharia de features relevantes; \n(3) desenvolvimento e comparação de modelos preditivos (regressão logística, random forests, redes neuronais); \n(4) validação dos modelos com dados de 200-400 alunos, medindo precisão, recall e AUC; \n(5) criação de dashboard de visualização, testes de usabilidade com professores e análise de resultados.","createdAt":{"$date":"2026-01-24T16:26:09.767Z"},"updatedAt":{"$date":"2026-01-24T17:38:29.752Z"},"__v":1}
{"_id":{"$oid":"6974f2f3f304208c863fed52"},"titulo":"Chatbot Educativo Baseado em Processamento de Linguagem Natural para Apoio ao Estudo no Ensino Secundário","orientadorId":{"$oid":"6973b720ffbe3c66075a2a88"},"coorientadorIds":[],"palavrasChave":["Processamento de Linguagem Natural","Chatbot educativo","Inteligência Artificial","Tutoria automatizada","Aprendizagem personalizada"],"alunoIds":[],"descricaoObjetivos":"Este trabalho propõe o desenvolvimento de um assistente virtual inteligente (chatbot) que utiliza técnicas de Processamento de Linguagem Natural (NLP) para apoiar alunos do ensino secundário no esclarecimento de dúvidas e consolidação de conhecimentos em disciplinas específicas (ex: Matemática, Física). O objetivo principal é avaliar a eficácia do chatbot na resolução de dúvidas, satisfação dos alunos e redução da carga de trabalho dos professores, disponibilizando apoio 24/7.\nAdota-se uma abordagem Design Science Research com metodologia mista, dividida em cinco fases: \n(1) análise de requisitos através de inquéritos a alunos e professores, identificando tipos de dúvidas frequentes;\n(2) design da arquitetura conversacional e seleção de tecnologias NLP (GPT, BERT ou similar); \n(3) desenvolvimento do chatbot com integração em plataforma web/mobile e criação de base de conhecimento específica; \n(4) avaliação com 60-100 alunos durante 4-6 semanas, recolhendo dados de utilização, satisfação (questionários) e feedback qualitativo (entrevistas); \n(5) análise de resultados e otimização do modelo conversacional.","createdAt":{"$date":"2026-01-24T16:27:31.802Z"},"updatedAt":{"$date":"2026-01-24T16:27:31.802Z"},"__v":0}
